tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mutagen-io/mutagen"

brew "curl"
brew "git"
brew "hugo"
brew "openjdk"
brew "kotlin"
brew "maven"
brew "python@3.10"
brew "python@3.9"
brew "rust"
brew "the_silver_searcher"
brew "tldr"
brew "wget"
brew "zsh"

cask "android-platform-tools"
cask "brave-browser"
cask "coconutbattery"
cask "discord"
cask "epic-games"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "jetbrains-toolbox"
cask "joplin"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "signal"
cask "sonic-pi"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
