tap "homebrew/bundle"
tap "mutagen-io/mutagen"
brew "btop"
brew "ruby"
brew "cocoapods"
brew "curl"
brew "deno"
brew "docker", link: false
brew "ffmpeg"
brew "git"
brew "gnupg"
brew "htop"
brew "hugo"
brew "icu4c@76"
brew "kdoctor"
brew "openjdk"
brew "kotlin"
brew "maven"
brew "node"
brew "pgvector"
brew "pkgconf"
brew "postgresql@14"
brew "pyenv"
brew "scrcpy"
brew "the_silver_searcher"
brew "tldr"
brew "uv"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh"
cask "android-file-transfer"
cask "android-platform-tools"
cask "calibre"
cask "claude-code"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "logi-options+"
cask "notion"
cask "pocket-casts"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "xld"
cask "zoom"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
