tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "python@3.10"
brew "wget"
brew "tldr"
brew "the_silver_searcher"
brew "hugo"
brew "zsh"
brew "zsh-autosuggestions"

brew "awscli"
brew "docker"
brew "kubernetes-cli"
brew "helm"

# ui - dev tools
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "postman"
cask "bloomrpc"

# ui - productivity
cask "discord"
cask "notion"
cask "joplin"

# ui - browsers
cask "brave-browser"
cask "firefox"

# ui - media
cask "spotify"
